library;


// 目前不支持字符串，不要测试了
//

List<String> debugTests = [
  '() {} [] <> a abc 1 123 3.14 ',
  '''a=<>:fill(20, (i){rand()*100}) n = #arr (i){swapped = 0 {r=arr} ?? (~swapped)}loop(n-1) (j){}loop(n-i) {arr[j] <-> arr[j+1]}??(swapped = arr[j] ?> arr[j + 1]) r=arr''',
  '''
// 列举所有可能种植情况（注意这些是直接在外面的）
// 值
a 1 "" <> [] {} () // 量
abc 1.23
(1) ("") (<>) ({}) ([]) ((1)) // 包裹
// 函数调用
// 1. = 赋值函数
a=1 a="" a=<> a={} // 除函数以外类型
a=(){} a()=0 a=[] // 定义有名函数
// 2. 一般函数
// 前缀调用
f()  {}()  (){}()
// 中缀调用
{}f{} {}f() {}f<> {}f"" {}f[]
()f{} ()f() ()f<> ()f"" ()f[]
<>f{} <>f() <>f<> <>f"" <>f[]
""f{} ""f() ""f<> ""f"" ""f[]
[]f{} []f() []f<> []f"" []f[]
// 3. 运算符
1 + 1 - 3 * 4 / 5 ^ 6 ?= 5 % 2 != 5 //?< 8 ?> 7 <= 4 >= 3 
// 一元运算符
(-1)
//
()?() {}?() ""?() <>?() []?()
{}??():{}
// 4. 访问和操作()
<>.a  <>[1]  <>:a     
<>.a() 
a.a a[1]  a:a       
a.a=1  a[1]=1
// 测试
a=[ b=[<>, { x +45 6 -3  f() {}f"" }, <1-f(), "">] ]
x +456 -3
x +4 5 6 -3

''',
];
